<center> <img src = https://raw.githubusercontent.com/AndreyRysistov/DatasetsForPandas/main/hh%20label.jpg alt="drawing" style="width:400px;">

# <center> Проект: Анализ вакансий из HeadHunter

In [3143]:
import pandas as pd
import psycopg2

In [3144]:
# вставьте сюда параметры подключения из юнита 1. Работа с базой данных из Python 
DBNAME = 'project_sql'
USER = 'skillfactory'
PASSWORD = 'cCkxxLVrDE8EbvjueeMedPKt'
HOST = '84.201.134.129'
PORT = 5432

In [3145]:
connection = psycopg2.connect(
    dbname=DBNAME,
    user=USER,
    host=HOST,
    password=PASSWORD,
    port=PORT
)

# Юнит 3. Предварительный анализ данных

1. Напишите запрос, который посчитает количество вакансий в нашей базе (вакансии находятся в таблице vacancies).

In [3146]:
# текст запроса
query_3_1 = f'''select count(*)
                from vacancies
'''

In [3147]:
# результат запроса
df = pd.read_sql_query(query_3_1, connection)
df

C:\Users\mkost\AppData\Local\Temp\ipykernel_39968\1114379196.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_3_1, connection)

   count
0  49197

2. Напишите запрос, который посчитает количество работодателей (таблица employers).

In [3148]:
# текст запроса
query_3_2 = f'''select count(*)
                from employers
'''

In [3149]:
# результат запроса
df = pd.read_sql_query(query_3_2, connection)
df

C:\Users\mkost\AppData\Local\Temp\ipykernel_39968\3062646138.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_3_2, connection)

   count
0  23501

3. Посчитате с помощью запроса количество регионов (таблица areas).

In [3150]:
# текст запроса
query_3_3 = f'''select count(*)
                from areas
'''

In [3151]:
# результат запроса
df = pd.read_sql_query(query_3_3, connection)
df

C:\Users\mkost\AppData\Local\Temp\ipykernel_39968\928149064.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_3_3, connection)

   count
0   1362

4. Посчитате с помощью запроса количество сфер деятельности в базе (таблица industries).

In [3152]:
# текст запроса
query_3_4 = f'''select count(*)
                from industries
'''

In [3153]:
# результат запроса
df = pd.read_sql_query(query_3_4, connection)
df

C:\Users\mkost\AppData\Local\Temp\ipykernel_39968\2101691108.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_3_4, connection)

   count
0    294

***

# выводы по предварительному анализу данных
провели предварительный анализ данных и выяснили количество строк в каждой из таблиц

# Юнит 4. Детальный анализ вакансий

1. Напишите запрос, который позволит узнать, сколько (cnt) вакансий в каждом регионе (area).
Отсортируйте по количеству вакансий в порядке убывания.

In [3154]:
# текст запроса
query_4_1 = f'''select count(v.id) cnt, 
                       a.name area
                from vacancies v
                join areas a on v.area_id = a.id
                group by 2
                order by 1 desc
                limit 5
'''

In [3155]:
# результат запроса
df = pd.read_sql_query(query_4_1, connection)
df

C:\Users\mkost\AppData\Local\Temp\ipykernel_39968\2457173557.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_4_1, connection)

    cnt             area
0  5333           Москва
1  2851  Санкт-Петербург
2  2112            Минск
3  2006      Новосибирск
4  1892           Алматы

2. Напишите запрос, чтобы определить у какого количества вакансий заполнено хотя бы одно из двух полей с зарплатой.

In [3156]:
# текст запроса
query_4_2= f''' select count(v.id)
                from vacancies v
                where v.salary_from is not null or v.salary_to is not null
'''

In [3157]:
# результат запроса
df = pd.read_sql_query(query_4_2, connection)
df

C:\Users\mkost\AppData\Local\Temp\ipykernel_39968\970655580.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_4_2, connection)

   count
0  24073

3. Найдите средние значения для нижней и верхней границы зарплатной вилки. Округлите значения до целого.

In [3158]:
# текст запроса
query_4_3= f''' select avg(v.salary_from) avg_min, 
                       avg(salary_to) avg_max
                from vacancies v
                where v.salary_from is not null or v.salary_to is not null
'''

In [3159]:
# результат запроса
df = pd.read_sql_query(query_4_3, connection)
df

C:\Users\mkost\AppData\Local\Temp\ipykernel_39968\2500607024.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_4_3, connection)

        avg_min        avg_max
0  71064.657901  110536.741923

4. Напишите запрос, который выведет количество вакансий для каждого сочетания типа рабочего графика (schedule) и типа трудоустройства (employment), используемого в вакансиях. Результат отсортируйте по убыванию количества.

In [3160]:
# текст запроса
query_4_4 = f'''select count(v.id), 
                       v.schedule, 
                       v.employment
                from vacancies v
                group by 2, 3
                order by 1 desc
                limit 2
'''

In [3161]:
# результат запроса
df = pd.read_sql_query(query_4_4, connection)
df

C:\Users\mkost\AppData\Local\Temp\ipykernel_39968\2022935265.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_4_4, connection)

   count          schedule        employment
0  35367       Полный день  Полная занятость
1   7802  Удаленная работа  Полная занятость

5. Напишите запрос, выводящий значения поля Требуемый опыт работы (experience) в порядке возрастания количества вакансий, в которых указан данный вариант опыта.

In [3162]:
# текст запроса
query_4_5 = f'''select v.experience
                from vacancies v
                group by 1
                order by count(v.id) 
'''

In [3163]:
# результат запроса
df = pd.read_sql_query(query_4_5, connection)
df

C:\Users\mkost\AppData\Local\Temp\ipykernel_39968\2316260449.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_4_5, connection)

           experience
0         Более 6 лет
1           Нет опыта
2       От 3 до 6 лет
3  От 1 года до 3 лет

***

# выводы по детальному анализу вакансий
#### Провели детальный анализ вакансий: 
определили, в каких регионах наблюдается наибольшее количество вакансий, узнали наиболее частые требования к опыту работы, определили основной диапазон зарплат, столбцы employment и schedule помогли понять, какие типы занятости и графики работы предпочитают работодатели. 

Эти запросы помогли получить более глубокое понимание рынка труда и выявить ключевые тенденции, которые могут быть полезны как для соискателей, так и для работодателей.

# Юнит 5. Анализ работодателей

1. Напишите запрос, который позволит узнать, какие работодатели находятся на первом и пятом месте по количеству вакансий.

In [3164]:
# текст запроса
query_5_1 = f'''select e.name employer_name, 
                       count(*) cnt_vacancies
                from vacancies v
                join employers e on v.employer_id = e.id
                group by 1
                order by 2 desc
                limit 5
'''

In [3165]:
# результат запроса
df = pd.read_sql_query(query_5_1, connection)
df

C:\Users\mkost\AppData\Local\Temp\ipykernel_39968\3834399874.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_5_1, connection)

   employer_name  cnt_vacancies
0         Яндекс           1933
1     Ростелеком            491
2       Тинькофф            444
3           СБЕР            428
4  Газпром нефть            331

2. Напишите запрос, который для каждого региона выведет количество работодателей и вакансий в нём.
Среди регионов, в которых нет вакансий, найдите тот, в котором наибольшее количество работодателей.

In [3166]:
# текст запроса
query_5_2 = f'''select a.name area_name,
                       count(e.id) employer_cnt, 
                       count(v.id) cnt_vacancies
                from areas a
                left join employers e on e.area = a.id
                left join vacancies v on v.area_id = a.id
                where v.id is null
                group by 1
                order by 2 desc      
'''

In [3167]:
# результат запроса
df = pd.read_sql_query(query_5_2, connection)
df

C:\Users\mkost\AppData\Local\Temp\ipykernel_39968\2250345976.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_5_2, connection)

                          area_name  employer_cnt  cnt_vacancies
0                            Россия           410              0
1                         Казахстан           207              0
2                Московская область            75              0
3                Краснодарский край            19              0
4                          Беларусь            18              0
..                              ...           ...            ...
588                        Кувандык             0              0
589                        Куйбышев             0              0
590  Куйбышево (Ростовская область)             0              0
591                        Култаево             0              0
592                        Кульсары             0              0

[593 rows x 3 columns]

3. Для каждого работодателя посчитайте количество регионов, в которых он публикует свои вакансии. Отсортируйте результат по убыванию количества.

In [3168]:
# текст запроса
query_5_3 = f'''select e.name employer_name,
                       count(distinct v.area_id) region_cnt
               from employers e
               join vacancies v on e.id = v.employer_id
               group by 1
               order by 2 desc, 1
'''

In [3169]:
# результат запроса
df = pd.read_sql_query(query_5_3, connection)
df

C:\Users\mkost\AppData\Local\Temp\ipykernel_39968\201667002.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_5_3, connection)

                 employer_name  region_cnt
0                       Яндекс         181
1                   Ростелеком         152
2                   Спецремонт         116
3       Поляков Денис Иванович          88
4                    ООО ЕФИН           71
...                        ...         ...
14761     Яроцкий Е. В./ MoonX           1
14762  Ясли-сад №374 г. Минска           1
14763                      ЯСП           1
14764        Ястро-Переработка           1
14765                     ЯТСС           1

[14766 rows x 2 columns]

4. Напишите запрос для подсчёта количества работодателей, у которых не указана сфера деятельности.

In [3170]:
# текст запроса
query_5_4 = f'''select count(distinct e.id) no_ind_emp_cnt
                from employers e
                left join employers_industries ei on e.id = ei.employer_id
                where ei.industry_id is null
'''

In [3171]:
# результат запроса
df = pd.read_sql_query(query_5_4, connection)
df

C:\Users\mkost\AppData\Local\Temp\ipykernel_39968\3493105328.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_5_4, connection)

   no_ind_emp_cnt
0            8419

5. Напишите запрос, чтобы узнать название компании, находящейся на третьем месте в алфавитном списке (по названию) компаний, у которых указано четыре сферы деятельности.

In [3172]:
# текст запроса
query_5_5 = f'''select e.name company_name
                from employers e
                join employers_industries ei on e.id = ei.employer_id
                group by 1
                having count(ei.industry_id) = 4
                order by 1
                limit 1
                offset 2
'''

In [3173]:
# результат запроса
df = pd.read_sql_query(query_5_5, connection)
df

C:\Users\mkost\AppData\Local\Temp\ipykernel_39968\388711819.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_5_5, connection)

  company_name
0         2ГИС

6. С помощью запроса выясните, у какого количества работодателей в качестве сферы деятельности указана Разработка программного обеспечения.

In [3174]:
# текст запроса
query_5_6 = f'''select count(distinct e.id) emp_cnt
                from employers e
                join employers_industries ei on e.id = ei.employer_id
                join industries i on i.id = ei.industry_id
                where i.name = 'Разработка программного обеспечения'
'''

In [3175]:
# результат запроса
df = pd.read_sql_query(query_5_6, connection)
df

C:\Users\mkost\AppData\Local\Temp\ipykernel_39968\821628714.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_5_6, connection)

   emp_cnt
0     3553

7. Для компании «Яндекс» выведите список регионов-миллионников, в которых представлены вакансии компании, вместе с количеством вакансий в этих регионах. Также добавьте строку Total с общим количеством вакансий компании. Результат отсортируйте по возрастанию количества.

Список городов-милионников надо взять [отсюда](https://ru.wikipedia.org/wiki/%D0%93%D0%BE%D1%80%D0%BE%D0%B4%D0%B0-%D0%BC%D0%B8%D0%BB%D0%BB%D0%B8%D0%BE%D0%BD%D0%B5%D1%80%D1%8B_%D0%A0%D0%BE%D1%81%D1%81%D0%B8%D0%B8). 

Если возникнут трудности с этим задание посмотрите материалы модуля  PYTHON-17. Как получать данные из веб-источников и API.

In [3176]:
# код для получения списка городов-милионников
import requests
from bs4 import BeautifulSoup

url = 'https://ru.wikipedia.org/wiki/Города-миллионеры_России'
response = requests.get(url)
# дальше работа с содержимым страницы
page = BeautifulSoup(response.text, 'html.parser') # Создаём объект BeautifulSoup, указывая html-парсер
data = []
HTML_data = page.find_all("table")[0].find_all("tr")[1:]
for element in HTML_data:
    sub_data = []
    for i, k in enumerate (element) :
        try:
            if i == 1:
                sub_data.append(k.get_text())
        except:
            continue
    data.append(sub_data)
data_result = []
for elem in data:
    data_result.extend(elem)
data_result = tuple(data_result)
data_result

('Москва',
 'Санкт-Петербург',
 'Новосибирск',
 'Екатеринбург',
 'Казань',
 'Красноярск',
 'Нижний Новгород',
 'Челябинск',
 'Уфа',
 'Самара',
 'Ростов-на-Дону',
 'Краснодар',
 'Омск',
 'Воронеж',
 'Пермь',
 'Волгоград')

In [3177]:
# текст запроса
query_5_7 = f'''with temp as (
                    select
                    a.name city_name,
                    count(v.id) cnt
                    from vacancies v
                    left join employers e on v.employer_id = e.id
                    left join areas a on a.id = v.area_id
                    where a.name in {data_result}
                    and e.name = 'Яндекс'
                    group by 1
                    ),
                total as (
                    select
                    'Total' city_name,
                    sum(cnt) cnt
                    from temp
                    )
                select 
                city_name, cnt from (
                    select * from temp
                    union all
                    select * from total
                ) as combined
                order by case when city_name = 'Total' then 1 else 0 end, cnt;
'''

In [3178]:
# результат запроса
df = pd.read_sql_query(query_5_7, connection)
df

C:\Users\mkost\AppData\Local\Temp\ipykernel_39968\1965596796.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_5_7, connection)

          city_name    cnt
0              Омск   21.0
1         Челябинск   22.0
2        Красноярск   23.0
3         Волгоград   24.0
4             Пермь   25.0
5            Казань   25.0
6    Ростов-на-Дону   25.0
7            Самара   26.0
8               Уфа   26.0
9         Краснодар   30.0
10          Воронеж   32.0
11      Новосибирск   35.0
12  Нижний Новгород   36.0
13     Екатеринбург   39.0
14  Санкт-Петербург   42.0
15           Москва   54.0
16            Total  485.0

***

# выводы по анализу работодателей
## Количество Вакансий по Работодателям
### Лидеры по количеству вакансий:

Есть несколько компаний, которые существенно опережают других работодателей по количеству опубликованных вакансий. Эти компании, скорее всего, являются крупными организациями с высоким спросом на новые кадры.

### Разброс вакансий:

Компании с наибольшим количеством вакансий, как правило, находятся в лидирующих отраслях и присутствуют в большом числе регионов.

## Сферы Деятельности

### Работодатели без указания сферы деятельности:

Есть значительное количество работодателей, которые не указали свою сферу деятельности. Это может усложнить их поиск и классификацию в системе.

### Компании с широким спектром деятельности:

Есть компании, у которых указано несколько сфер деятельности, что указывает на их диверсификацию и широкий спектр услуг или продуктов.

### Популярные сферы:

Сфера "Разработка программного обеспечения" является одной из самых популярных. Много работодателей указывают именно эту сферу деятельности, что отражает высокий спрос на IT-специалистов.

##### Этот анализ предоставляет ценные инсайты для стратегического планирования и оптимизации рекрутинговых процессов, а также для понимания текущего состояния рынка труда и выявления областей для улучшения.

# Юнит 6. Предметный анализ

1. Сколько вакансий имеет отношение к данным?

Считаем, что вакансия имеет отношение к данным, если в её названии содержатся слова 'data' или 'данн'.

*Подсказка: Обратите внимание, что названия вакансий могут быть написаны в любом регистре.*

In [3179]:
# текст запроса
query_6_1 = f'''select count(*) data_vac_cnt
                from vacancies
                where lower(name) like '%data%' or lower(name) like '%данн%'
'''

In [3180]:
# результат запроса
df = pd.read_sql_query(query_6_1, connection)
df

C:\Users\mkost\AppData\Local\Temp\ipykernel_39968\366702258.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_6_1, connection)

   data_vac_cnt
0          1771

2. Сколько есть подходящих вакансий для начинающего дата-сайентиста? 
Будем считать вакансиями для дата-сайентистов такие, в названии которых есть хотя бы одно из следующих сочетаний:
* 'data scientist'
* 'data science'
* 'исследователь данных'
* 'ML' (здесь не нужно брать вакансии по HTML)
* 'machine learning'
* 'машинн%обучен%'

** В следующих заданиях мы продолжим работать с вакансиями по этому условию.*

Считаем вакансиями для специалистов уровня Junior следующие:
* в названии есть слово 'junior' *или*
* требуемый опыт — Нет опыта *или*
* тип трудоустройства — Стажировка.

In [3181]:
# текст запроса
query_6_2 = f'''with ds_vacs as (
                    select *
                    from vacancies
                    where
                        lower(name) like '%data scientist%'
                        or lower(name) like '%data science%'
                        or lower(name) like '%исследователь данных%'
                        or (lower(name) like '%ml%' 
                        and lower(name) not like '%html%')
                        or lower(name) like '%machine learning%'
                        or lower(name) like '%машинн%обучен%'
                    )
                select count(*) jun_ds_vacs_cnt
                from ds_vacs
                where
                    lower(name) like '%junior%'
                    or experience = 'Нет опыта'
                    or employment = 'Стажировка'
'''

In [3182]:
# результат запроса
df = pd.read_sql_query(query_6_2, connection)
df

C:\Users\mkost\AppData\Local\Temp\ipykernel_39968\2267038862.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_6_2, connection)

   jun_ds_vacs_cnt
0               51

3. Сколько есть вакансий для DS, в которых в качестве ключевого навыка указан SQL или postgres?

** Критерии для отнесения вакансии к DS указаны в предыдущем задании.*

In [3183]:
# текст запроса
query_6_3 = f'''with ds_vacs as (
                    select *
                    from vacancies
                    where
                        lower(name) like '%data scientist%'
                        or lower(name) like '%data science%'
                        or lower(name) like '%исследователь данных%'
                        or (lower(name) like '%ml%' 
                        and lower(name) not like '%html%')
                        or lower(name) like '%machine learning%'
                        or lower(name) like '%машинн%обучен%'
                    )
                select count(*) 
                from ds_vacs
                where 
                    lower(key_skills) like '%sql%'
                    or lower(key_skills) like '%postgres%'
'''

In [3184]:
# результат запроса
df = pd.read_sql_query(query_6_3, connection)
df

C:\Users\mkost\AppData\Local\Temp\ipykernel_39968\3794299702.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_6_3, connection)

   count
0    229

4. Проверьте, насколько популярен Python в требованиях работодателей к DS.Для этого вычислите количество вакансий, в которых в качестве ключевого навыка указан Python.

** Это можно сделать помощью запроса, аналогичного предыдущему.*

In [3185]:
# текст запроса
query_6_4 = f'''with ds_vacs as (
                    select *
                    from vacancies
                    where
                        lower(name) like '%data scientist%'
                        or lower(name) like '%data science%'
                        or lower(name) like '%исследователь данных%'
                        or (lower(name) like '%ml%' 
                        and lower(name) not like '%html%')
                        or lower(name) like '%machine learning%'
                        or lower(name) like '%машинн%обучен%'
                    )
                select count(*) 
                from ds_vacs
                where 
                    lower(key_skills) like '%python%'
'''

In [3186]:
# результат запроса
df = pd.read_sql_query(query_6_4, connection)
df

C:\Users\mkost\AppData\Local\Temp\ipykernel_39968\4264665179.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_6_4, connection)

   count
0    357

5. Сколько ключевых навыков в среднем указывают в вакансиях для DS?
Ответ округлите до двух знаков после точки-разделителя.

In [3187]:
# текст запроса
query_6_5 = f'''select 
                round(avg(length(key_skills) - length(replace(key_skills, CHR(9), '')) + 1), 2)
                from vacancies
                where     
                    (lower(name) like '%data scientist%'
                    or lower(name) like '%data science%'
                    or lower(name) like '%исследователь данных%'
                    OR (name like '%ML%' and lower(name) not like '%html%')
                    or lower(name) like '%machine learning%'
                    or lower(name) like '%машинн%обучен%')
                    and (key_skills is not null)
'''

In [3188]:
# результат запроса
df = pd.read_sql_query(query_6_5, connection)
df

C:\Users\mkost\AppData\Local\Temp\ipykernel_39968\3654210517.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_6_5, connection)

   round
0   6.41

6. Напишите запрос, позволяющий вычислить, какую зарплату для DS в **среднем** указывают для каждого типа требуемого опыта (уникальное значение из поля *experience*). 

При решении задачи примите во внимание следующее:
1. Рассматриваем только вакансии, у которых заполнено хотя бы одно из двух полей с зарплатой.
2. Если заполнены оба поля с зарплатой, то считаем зарплату по каждой вакансии как сумму двух полей, делённую на 2. Если заполнено только одно из полей, то его и считаем зарплатой по вакансии.
3. Если в расчётах участвует null, в результате он тоже даст null (посмотрите, что возвращает запрос select 1 + null). Чтобы избежать этой ситуацию, мы воспользуемся функцией [coalesce](https://postgrespro.ru/docs/postgresql/9.5/functions-conditional#functions-coalesce-nvl-ifnull), которая заменит null на значение, которое мы передадим. Например, посмотрите, что возвращает запрос `select 1 + coalesce(null, 0)`

Выясните, на какую зарплату в среднем может рассчитывать дата-сайентист с опытом работы от 3 до 6 лет. Результат округлите до целого числа.

In [3189]:
# текст запроса
query_6_6 = f'''with ds_vacs as (
                    select experience,
                    (coalesce(salary_from, 0) + coalesce(salary_to, 0)) / 
                    nullif(case 
                    when salary_from is not null and salary_to is not null then 2 
                    else 1 
                    end, 0) as average_salary
                    from vacancies
                    where
                        (lower(name) like '%data scientist%'
                        or lower(name) like '%data science%'
                        or lower(name) like '%исследователь данных%'
                        or (name like '%ML%' and lower(name) not like '%html%')
                        or lower(name) like '%machine learning%'
                        or lower(name) like '%машинн%обучен%')
                        and (salary_from is not null or salary_to is not null)
                    )
                select
                experience,
                round(avg(average_salary)) avg_salary
                from ds_vacs
                group by experience
                order by experience;
'''

In [3190]:
# результат запроса
df = pd.read_sql_query(query_6_6, connection)
df

C:\Users\mkost\AppData\Local\Temp\ipykernel_39968\519194770.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_6_6, connection)

           experience  avg_salary
0           Нет опыта     74643.0
1  От 1 года до 3 лет    139675.0
2       От 3 до 6 лет    243115.0

***

# выводы по предметному анализу
### Общее количество вакансий:

Проведя анализ названий вакансий, выяснилось, что значительное количество вакансий связано с обработкой и анализом данных. Это свидетельствует о высоком спросе на специалистов в области Data Science.

### Подходящие вакансии для начинающих дата-сайентистов:

Количество вакансий для Junior Data Scientists также оказалось значительным. Это означает, что многие компании готовы нанимать и обучать молодых специалистов, что положительно влияет на рынок труда и предоставляет возможности для карьерного роста.

### Ключевые навыки:

Среднее количество ключевых навыков, указанных в вакансиях для Data Scientists, показывает, что работодатели ожидают от кандидатов наличие определенных технических и аналитических навыков. Это может включать знание программирования, работы с большими данными, машинного обучения и других связанных областей.

### Средняя зарплата:

Средняя зарплата для Data Scientists варьируется в зависимости от опыта. Например, для специалистов с опытом от 3 до 6 лет средняя зарплата составляет примерно 240 тысяч рублей, что свидетельствует о высокой оценке труда опытных специалистов в этой области.

# Общий вывод по проекту

# подведем итог исследования, обобщите выводы
Анализ вакансий показал, что рынок труда для Data Scientists активно развивается, с высоким спросом на специалистов в этой области. Вакансий много, особенно в крупных городах, таких как Москва и Санкт-Петербург. Вакансии для начинающих специалистов также присутствуют в значительном количестве, что создает благоприятные условия для входа в профессию. Требования к кандидатам включают наличие специфических навыков и опыта, что подчеркивает необходимость постоянного обучения и повышения квалификации. Средняя зарплата Data Scientists достаточно высокая, особенно для опытных специалистов, что делает эту профессию привлекательной на рынке труда.

### Дополнительные исследования

In [3191]:
#  Исследование зарплат в зависимости от региона
query_7_1 = f'''select 
                a.name as region, 
                round(avg((coalesce(salary_from, 0) + coalesce(salary_to, 0)) / 
                nullif(case when salary_from is not null and salary_to is not null then 2 else 1 end, 0))) as average_salary
                from vacancies v
                join areas a on v.area_id = a.id
                where
                    (lower(v.name) like '%data scientist%'
                    or lower(v.name) like '%data science%'
                    or lower(v.name) like '%исследователь данных%'
                    or (v.name like '%ML%' and lower(v.name) not like '%html%')
                    or lower(v.name) like '%machine learning%'
                    or lower(v.name) like '%машинн%обучен%')
                    and (salary_from is not null or salary_to is not null)
                group by 1
                order by 2 desc 
                limit 10
'''

In [3192]:
# результат запроса
df = pd.read_sql_query(query_7_1, connection)
df

C:\Users\mkost\AppData\Local\Temp\ipykernel_39968\2931715827.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_7_1, connection)

            region  average_salary
0             Кипр        300000.0
1          Армения        268863.0
2       Черногория        233794.0
3           Турция        233794.0
4           Сербия        233794.0
5           Москва        207630.0
6         Белгород        200000.0
7  Санкт-Петербург        173335.0
8      Новосибирск        166333.0
9           Рязань        136667.0

In [3193]:
# Анализ распределения вакансий для каждого работодателя
query_7_2 = f'''with employer_regions as (
                    select
                    e.id employer_id,
                    e.name employer_name,
                    a.name region_name,
                    count(v.id) vacancy_count
                    from vacancies v
                    join employers e on v.employer_id = e.id
                    join areas a on v.area_id = a.id
                    where
                        lower(v.name) like '%data scientist%'
                        or lower(v.name) like '%data science%'
                        or lower(v.name) like '%исследователь данных%'
                        or (v.name like '%ML%' and lower(v.name) not like '%html%')
                        or lower(v.name) like '%machine learning%'
                        or lower(v.name) like '%машинн%обучен%'
                    group by e.id, e.name, a.name),
                employer_region_count as (
                    select
                    employer_id,
                    employer_name,
                    count(distinct region_name) region_count
                    from employer_regions
                    group by employer_id, employer_name),
                employer_max_region as (
                    select
                    employer_id,
                    region_name,
                    vacancy_count,
                    row_number() over (partition by employer_id order by vacancy_count desc) rn
                    from employer_regions)
                select
                erc.employer_name,
                erc.region_count,
                emr.region_name AS region_with_max_vacs,
                emr.vacancy_count AS max_vacancies
                from employer_region_count erc
                join employer_max_region emr on erc.employer_id = emr.employer_id and emr.rn = 1
                order by erc.region_count desc
                limit 10
'''

In [3194]:
df = pd.read_sql_query(query_7_2, connection)
df

C:\Users\mkost\AppData\Local\Temp\ipykernel_39968\2993136978.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_7_2, connection)

           employer_name  region_count region_with_max_vacs  max_vacancies
0        Bell Integrator            18               Москва              2
1         Банк ВТБ (ПАО)             9               Москва              6
2         EvenBet Gaming             9               Брянск              1
3     Бэнкс Софт Системс             6               Казань              1
4  Positive Technologies             5                Томск              3
5                   2ГИС             5               Казань              1
6                МегаФон             5               Москва              3
7                 Яндекс             5               Москва              4
8               Andersen             5              Армения              3
9            Спортмастер             4               Москва              2

В результате проделанной работы по анализу вакансий для Data Scientists выявлены ключевые тенденции на рынке труда. Спрос на специалистов в области данных стабильно высокий, особенно в крупных городах. Средние зарплаты значительно зависят от опыта работы и региона. Вакансии для начинающих специалистов также присутствуют, что свидетельствует о возможности роста в данной профессии. Проведенные дополнительные исследования и прогнозы помогут лучше понять текущие и будущие тенденции рынка труда, что будет полезно как для соискателей, так и для работодателей.